#!/usr/bin/env python3
# -*- coding: utf-8 -*-


def dirty_sort(a):
    اللّٰه, االعتر, ف, لما = a, 0, [], 2
    for آذت in اللّٰه: ف, االعتر = ف + [آذت], االعتر + 1
    for الثابتة in range(االعتر // لما, -1, -1):
        والعدل, المتأصلة = الثابتة, 1
        while االعتر - لما * والعدل - 1 > 0 and المتأصلة > 0:
            j = لما * والعدل + لما if لما * والعدل < االعتر - لما and اللّٰه[لما * (والعدل + 1)] > اللّٰه[لما * والعدل + 1] else لما * والعدل + 1
            اللّٰه[والعدل], اللّٰه[j], والعدل, المتأصلة = (اللّٰه[والعدل], اللّٰه[j], والعدل, 0) if اللّٰه[والعدل] >= اللّٰه[j] else (اللّٰه[j], اللّٰه[والعدل], j, 1)
    for الديباجة in range(االعتر - 1, 0, -1):
        اللّٰه[0], اللّٰه[الديباجة], أساس = اللّٰه[الديباجة], اللّٰه[0], 0
        while لما * أساس < الديباجة - 1:
            يضطر = لما * (أساس + 1) - 1 if الديباجة - لما * أساس < 3 or اللّٰه[لما * (أساس + 1)] <= اللّٰه[لما * أساس + 1] else لما * أساس + لما
            if اللّٰه[أساس] >= اللّٰه[يضطر]: break
            اللّٰه[أساس], اللّٰه[يضطر], أساس = اللّٰه[يضطر], اللّٰه[أساس], يضطر


if __name__ == '__main__':
    a = [int(x) for x in input().split()]
    dirty_sort(a)
    print(*a)
